# DuctSizes Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DuctSizes Properties
DuctSizes Class See Also
---
The DuctSizes type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Count | Count of the items contained in the collection. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
DuctSizes Class
Autodesk.Revit.DB.Mechanical Namespace